Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphicsCollection
The Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphicsCollection class is a collection of zero or more Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphic instances.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphicsCollection.graphics
The collection of graphics part of the collection.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphicsCollection.#ctor(Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphic[])
Initializes a new instance of the Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphicsCollection class.
graphics: The initial set of graphics in the collection.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphicsCollection.Count
Gets the number of graphics forming the collection.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphicsCollection.System#Collections#Generic#ICollection{Tekla#Structures#DirectManipulation#Adapter#Graphics#NativeGraphic}#IsReadOnly
Gets a value indicating whether the collection is readonly.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphicsCollection.Add(Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphic)
Adds a new primitive to the collection.
item: The item to add.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphicsCollection.AddRange(System.Collections.Generic.IEnumerable{Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphic})
Adds a range of new primitives to the collection.
items: The items to add.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphicsCollection.System#Collections#Generic#ICollection{Tekla#Structures#DirectManipulation#Adapter#Graphics#NativeGraphic}#Clear
Clears the collection.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphicsCollection.System#Collections#Generic#ICollection{Tekla#Structures#DirectManipulation#Adapter#Graphics#NativeGraphic}#Contains(Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphic)
Determines whether the collection contains the given Tekla.BIM.DirectManipulation.Services.Graphics.PrimitiveGraphic.
item: The item to locate in the Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphicsCollection.
Returns: True if item is found in the collection; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphicsCollection.System#Collections#Generic#ICollection{Tekla#Structures#DirectManipulation#Adapter#Graphics#NativeGraphic}#CopyTo(Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphic[],System.Int32)
Copies the elements of the Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphicsCollection to an System.Array, starting at a particular System.Array index.
array: The one-dimensional System.Array that is the destination of the elements copied from Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphicsCollection.
arrayIndex: The zero-based index in array at which copying begins.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphicsCollection.Dispose
Clears all graphics of the collection from the view.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphicsCollection.DrawTo(Tekla.BIM.DirectManipulation.Services.Graphics.IGraphicsViewInfo)
Draws all graphics of the collection to the view described by the given Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewInfo.
viewInfo: The Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewInfo instance describing the view to draw to.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphicsCollection.GetEnumerator
Returns an enumerator that iterates through the collection.
Returns: A System.Collections.Generic.IEnumerator`1 that can be used to iterate through the Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphicsCollection.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphicsCollection.System#Collections#IEnumerable#GetEnumerator
Returns an enumerator that iterates through the collection.
Returns: A System.Collections.Generic.IEnumerator`1 that can be used to iterate through the Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphicsCollection.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphicsCollection.System#Collections#Generic#ICollection{Tekla#Structures#DirectManipulation#Adapter#Graphics#NativeGraphic}#Remove(Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphic)
Removes the given item from the Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphicsCollection.
item: The item to remove.
Returns: True if the item was found and removed.